.svn/pristine/b8/b8a47a8bb399dbd71068ec1e9ab4f8b1ed5df44d.svn-base

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:createQuoteRequest xmlns:ns2="http://stub.unotechsoft.com/wsdl/MotorService/">
            <ProductCode>___product_id___</ProductCode><!--3121-->
            <AuthenticationToken></AuthenticationToken>
            <CIAName></CIAName>
            <Campaign>___insurer_integration_agent_code___</Campaign><!--POLICYBOSS-->
            <HashKey></HashKey>
            <HostAddress></HostAddress>
            <Medium>___insurer_integration_agent_code___</Medium><!--POLICYBOSS-->
            <Source>TATA-AIG</Source>
            <InputXML><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<PrivateCarInsurancePolicy>
    <PropProductDetails_ProductCode>___product_id___</PropProductDetails_ProductCode>
    <PropPolicyEffectivedate_Fromdate_Mandatary>___policy_start_date___</PropPolicyEffectivedate_Fromdate_Mandatary>
    <PropRisks_VehicleType>Indigenous</PropRisks_VehicleType>
    <PropRisks_ProposalType>___vehicle_insurance_type___</PropRisks_ProposalType>
    <PropRisks_RiskVariant>PackageComprehensive</PropRisks_RiskVariant>
    <CustomerType>___vehicle_registration_type___</CustomerType>
    <FirstName>___first_name___</FirstName>
    <LastName>___first_name___</LastName>
    <PanNo>CQDPK2691K</PanNo>
    <PropCustomerDtls_CustomerID_Mandatary>6013516979</PropCustomerDtls_CustomerID_Mandatary>
    <PropCustomerDtls_CustomerName>PRASAD DARGE</PropCustomerDtls_CustomerName>
	<PropRisks_RegistrationNoAsPerOldLogic>false</PropRisks_RegistrationNoAsPerOldLogic>
    <PropRisks_RegNoNotRequired>___vehicle_insurance_type_3___</PropRisks_RegNoNotRequired>
    <PropRisks_RegistrationNumber>___registration_no_1___</PropRisks_RegistrationNumber><!--MH-->
    <PropRisks_RegistrationNumber2>___registration_no_2___</PropRisks_RegistrationNumber2><!--01-->
    <PropRisks_RegistrationNumber3>AB</PropRisks_RegistrationNumber3><!--___registration_no_3___-->
    <PropRisks_RegistrationNumber4>1234</PropRisks_RegistrationNumber4><!--___registration_no_4___-->
    <PropRisks_Manufacture>___dbmaster_insurer_vehicle_make_name___</PropRisks_Manufacture>
    <PropRisks_ModelVariant>___dbmaster_insurer_vehicle_variant_name___</PropRisks_ModelVariant>
    <PropRisks_ManufactureYear>___vehicle_manf_year___</PropRisks_ManufactureYear><!--2017-->
    <PropRisks_AuthorityLocation>___dbmaster_insurer_rto_district_name___</PropRisks_AuthorityLocation> <!-- RTO location-->
    <PropRisks_LoadingNewCarRplacmnt>0</PropRisks_LoadingNewCarRplacmnt>
    <PropRisks_IDVofthevehicle>___vehicle_expected_idv___</PropRisks_IDVofthevehicle><!-- doubt not available in the master motor fields-->
    <PropRisks_FuelType>___dbmaster_insurer_vehicle_fueltype___</PropRisks_FuelType><!-- -->
    <PropRisks_Dateofpurchase>___vehicle_registration_date___</PropRisks_Dateofpurchase><!--DATE FORMAT DD/MM/YYYY AAL DATES BE SEPAREATED BY /-->
    <PropRisks_DateofRegistration>___vehicle_registration_date___</PropRisks_DateofRegistration><!--DATE FORMAT DD/MM/YYYY AAL DATES BE SEPAREATED BY /-->
    <PropRisks_VehicleAge_Mandatary>___vehicle_age_year___</PropRisks_VehicleAge_Mandatary>
    <PropRisks_BasisOfRating>GLM</PropRisks_BasisOfRating>
    <PropRisks_CompulsoryPAwithOwnerDriver>true</PropRisks_CompulsoryPAwithOwnerDriver>
    <PropRisks_NoClaimBonusApplicable>___vehicle_ncb_next___</PropRisks_NoClaimBonusApplicable>
    <PropRisks_EntitledforNCB>___is_claim_exists___</PropRisks_EntitledforNCB>
    <PropRisks_SeatingCapacity>___dbmaster_insurer_vehicle_seatingcapacity___</PropRisks_SeatingCapacity>
    <PropRisks_CubicCapacity>___dbmaster_insurer_vehicle_cubiccapacity___</PropRisks_CubicCapacity>
    <PropRisks_NonElectricalAccessories>___non_electrical_accessory___</PropRisks_NonElectricalAccessories>
    <PropRisks_ElectricalAccessories>___electrical_accessory___</PropRisks_ElectricalAccessories>
    <PropRisks_CNGLPGkitValue>___external_bifuel_value___</PropRisks_CNGLPGkitValue>
    <PropRisks_NoOfPersonsNamed>___dbmaster_insurer_vehicle_seatingcapacity___</PropRisks_NoOfPersonsNamed>
    <PropRisks_SumInsuredPaidDriver>___pa_paid_driver_si___</PropRisks_SumInsuredPaidDriver>	
    <PropRisks_TPPDRestricted>No</PropRisks_TPPDRestricted>
    <PropRisks_VehcleFitWithFibrGlasFuelTank>false</PropRisks_VehcleFitWithFibrGlasFuelTank>
    <PropRisks_AntiTheftCheck>___is_antitheft_fit___</PropRisks_AntiTheftCheck>
    <PropRisks_Geographicalareaextention>false</PropRisks_Geographicalareaextention>
    <PropRisks_Expirydate>___policy_expiry_date___</PropRisks_Expirydate><!--DATE FORMAT DD/MM/YYYY AAL DATES BE SEPAREATED BY /-->
    <PropRisks_Discount></PropRisks_Discount>
    <PropRisks_AddOnPlanSelected>___addon_package_name___</PropRisks_AddOnPlanSelected>
    <PropRisks_AddOnChoiceOpted>Choice 1</PropRisks_AddOnChoiceOpted>
    <PropRisks_IsVehicleUsedforblindpersons>No</PropRisks_IsVehicleUsedforblindpersons>
    <PropRisks_VoluntaryDeductibleAmount>___voluntary_deductible___</PropRisks_VoluntaryDeductibleAmount>
    <PropRisks_ConsumablesExpenses>___addon_consumable_cover___</PropRisks_ConsumablesExpenses>
    <PropRisks_LossOfPersonalBelongings>___addon_personal_belonging_loss_cover___</PropRisks_LossOfPersonalBelongings>
    <PropRisks_SumAssuredEmergencyMedExp>0</PropRisks_SumAssuredEmergencyMedExp>
    <PropRisks_CourtesyHireCar>false</PropRisks_CourtesyHireCar>
    <PropRisks_EngineSecure>___addon_engine_protector_cover___</PropRisks_EngineSecure>
    <PropRisks_EngineSecureOptions>___addon_engine_protector_cover_2___</PropRisks_EngineSecureOptions>
    <PropRisks_TyreSecure>___addon_tyre_coverage_cover___</PropRisks_TyreSecure>
    <PropRisks_TyreSecureOption>___addon_tyre_coverage_cover_2___</PropRisks_TyreSecureOption>
    <PropRisks_KeyReplacement>___addon_key_lock_cover___</PropRisks_KeyReplacement>
    <PropRisks_SumAssuredAOY>10000</PropRisks_SumAssuredAOY>
    <PropRisks_RoadsideAssistance>___addon_road_assist_cover___</PropRisks_RoadsideAssistance>
    <PropRisks_DailyAllowance>false</PropRisks_DailyAllowance>
    <PropRisks_AutomobileAssociC>false</PropRisks_AutomobileAssociC>
    <PropRisks_AutoMobileAssocName></PropRisks_AutoMobileAssocName>
    <PropRisks_AAOmembershipno></PropRisks_AAOmembershipno>
    <PropRisks_Expirydate></PropRisks_Expirydate>       
    <PropRisks_ImprtdVehcleWoutPaymtCustmDuty>false</PropRisks_ImprtdVehcleWoutPaymtCustmDuty>
    <PropRisks_IsVehcleUsdForDrivngTuitions>false</PropRisks_IsVehcleUsdForDrivngTuitions>
    <PropRisks_CertifiedVintageCarByCarClub>false</PropRisks_CertifiedVintageCarByCarClub>
    <PropRisks_DepreciationReimbursement>___addon_zero_dep_cover___</PropRisks_DepreciationReimbursement>
    <PropRisks_ReturnToInvoice>___addon_invoice_price_cover___</PropRisks_ReturnToInvoice>
    <PropPreviousPolicyDetails_PolicyEffectiveFrom>___pre_policy_start_date___</PropPreviousPolicyDetails_PolicyEffectiveFrom>
    <PropPreviousPolicyDetails_PolicyEffectiveTo>___policy_expiry_date___</PropPreviousPolicyDetails_PolicyEffectiveTo>
    <PropPreviousPolicyDetails_OfficeCode>___dbmaster_previousinsurer_code___</PropPreviousPolicyDetails_OfficeCode>
    <PropPreviousPolicyDetails_OfficeAddress></PropPreviousPolicyDetails_OfficeAddress>
    <PropPreviousPolicyDetails_AddressLine2></PropPreviousPolicyDetails_AddressLine2>
    <PropPreviousPolicyDetails_AddressLine3></PropPreviousPolicyDetails_AddressLine3>
    <PropRisks_CityWherePrimarilyUsed>___dbmaster_insurer_rto_state_name___</PropRisks_CityWherePrimarilyUsed>
    <PropRisks_MainDriver>Self - Owner Driver</PropRisks_MainDriver>
	<PropRisks_Age>26</PropRisks_Age>
	<PropRisks_AgeDriver>26</PropRisks_AgeDriver>
    <PropIntermediaryDetails_IntermediaryCode>___insurer_integration_location_code___</PropIntermediaryDetails_IntermediaryCode><!--  value 3051994444-->
    <PropGeneralProposalInformation_OfficeName>Mumbai</PropGeneralProposalInformation_OfficeName><!--THANE-->
    <PropRisks_Model>___dbmaster_insurer_vehicle_model_name___</PropRisks_Model>
    <PropRisks_OtherChk1>___pa_named_passenger_si_2___</PropRisks_OtherChk1><!--false-->
    <PropRisks_OtherChk2>___pa_unnamed_passenger_si_2___</PropRisks_OtherChk2><!--false-->
    <PropRisks_OtherChk3>___pa_paid_driver_si_2___</PropRisks_OtherChk3><!--false-->
    <PropGeneralProposalInformation_BusinessType_Mandatary>___vehicle_insurance_type_2___</PropGeneralProposalInformation_BusinessType_Mandatary>
    <PropPolicyEffectivedate_Todate_Mandatary>___policy_end_date___</PropPolicyEffectivedate_Todate_Mandatary><!-- date format dd/mm/yyyy-->
    <PropPolicyEffectivedate_Tohour_Mandatary>23:59</PropPolicyEffectivedate_Tohour_Mandatary>
    <PropMODetails_TertiaryMOCode>WEBSERVICE</PropMODetails_TertiaryMOCode>
    <PropRisks_IsCNGLPGKitinsuredinPIP>___is_external_bifuel___</PropRisks_IsCNGLPGKitinsuredinPIP><!---->
    <PropRisks_NumberofPersonsUnnamed>___dbmaster_insurer_vehicle_seatingcapacity___</PropRisks_NumberofPersonsUnnamed><!--no of passenger-->
    <PropRisks_CapitalSIPerPerson>___pa_unnamed_passenger_si___</PropRisks_CapitalSIPerPerson><!--unnamed si-->
    <PropRisks_LiabilityToSoldierSailorAirMan>false</PropRisks_LiabilityToSoldierSailorAirMan>
    <PropRisks_RepairOfGlasPlastcFibNRubrGlas>true</PropRisks_RepairOfGlasPlastcFibNRubrGlas>
    <PropRisks_SumAssuredKeyReplacement>25000</PropRisks_SumAssuredKeyReplacement>
    <PropRisks_GroupPersonalAccident>false</PropRisks_GroupPersonalAccident>
    <PropRisks_SumAssuredLossOfPersonalBelong>10000</PropRisks_SumAssuredLossOfPersonalBelong>
    <PropRisks_RatioofAOAinAOY></PropRisks_RatioofAOAinAOY>
    <PropRisks_SumAssuredAOA>5000</PropRisks_SumAssuredAOA>
    <PropRisks_PerDayAllowance></PropRisks_PerDayAllowance>
    <PropRisks_AllowanceDaystheft>15</PropRisks_AllowanceDaystheft>
    <PropRisks_AllowanceDaysAccCourtHireCar>10</PropRisks_AllowanceDaysAccCourtHireCar>
    <PropRisks_AllowanceDaysTheftTotal>15</PropRisks_AllowanceDaysTheftTotal>
    <PropRisks_FranchiseDays>3</PropRisks_FranchiseDays>
    <PropRisks_AllowanceDaysAccident>10</PropRisks_AllowanceDaysAccident>
    <PropRisks_IsVehicleusedlimitedtopremises>false</PropRisks_IsVehicleusedlimitedtopremises>
    <PropPreviousPolicyDetails_NCBPercentage>___vehicle_ncb_current___</PropPreviousPolicyDetails_NCBPercentage>
    <PropRisks_InsuredHasDrivinglicense>true</PropRisks_InsuredHasDrivinglicense>
    <PropGeneralNodes_ApplicationDate>___current_date___</PropGeneralNodes_ApplicationDate><!--today's date and date format: dd/mm/yyyy-->
    <PropIntermediaryDetails_IntermediaryName>LANDMARK INSURANCE BROKERS PVT LTD</PropIntermediaryDetails_IntermediaryName>
    <PropIntermediaryDetails_IntermediaryType>Non-DM</PropIntermediaryDetails_IntermediaryType>
    <PropGeneralProposalInformation_BranchOfficeCode>90200</PropGeneralProposalInformation_BranchOfficeCode><!--90202-->
    <PropGeneralProposalInformation_OfficeCode>90200</PropGeneralProposalInformation_OfficeCode><!--90200-->
    <PropEndorsementDtls_IsSellerInsured>false</PropEndorsementDtls_IsSellerInsured>
    <PropGeneralProposalInformation_DisplayOfficeCode>0200</PropGeneralProposalInformation_DisplayOfficeCode>
    <PropRisks_VariantCode>___dbmaster_insurer_vehicle_variant_code___</PropRisks_VariantCode>
    <PropRisks_Airbag>N</PropRisks_Airbag>
    <PropRisks_ABS>N</PropRisks_ABS>
    <PropRisks_AutoTransmission></PropRisks_AutoTransmission>
    <PropRisks_TheftTarget>N</PropRisks_TheftTarget>
    <PropRisks_VehicleSegment>___dbmaster_insurer_vehicle_insurer_segmant___</PropRisks_VehicleSegment><!--Mid Size-->
    <PropRisks_Typeofbody></PropRisks_Typeofbody>
    <PropRisks_PeriodTo>___policy_end_date___</PropRisks_PeriodTo><!--date format dd/mm/yyyy-->
    <PropRisks_PeriodFrom>___policy_start_date___</PropRisks_PeriodFrom><!--date format dd/mm/yyyy-->
    <PropRisks_ManufacturerCode>___dbmaster_insurer_vehicle_make_code___</PropRisks_ManufacturerCode>
    <PropRisks_ModelCode>___dbmaster_insurer_vehicle_model_code___</PropRisks_ModelCode>
    <PropPolicyEffectivedate_Fromhour_Mandatary>00:00:01</PropPolicyEffectivedate_Fromhour_Mandatary>
    <PropRisks_VehicleTypeCode>45</PropRisks_VehicleTypeCode>
    <PropRisks_RTOCode>___registration_no_1___-___registration_no_2___</PropRisks_RTOCode><!--MH-06-->
    <PropRisks_RTOGroupCode>___dbmaster_insurer_rto_district_code___</PropRisks_RTOGroupCode>
    <IsThinCustomer>false</IsThinCustomer>
    <PropGeneralProposalInformation_ProposalDate_Mandatary>___current_date___</PropGeneralProposalInformation_ProposalDate_Mandatary><!--date format dd/mm/yyyy -->
    <PropPreviousPolicyDetails_ClaimLodgedInPast>___is_claim_exists_2___</PropPreviousPolicyDetails_ClaimLodgedInPast><!---->
    <PropPreviousPolicyDetails_ClaimAmount>0</PropPreviousPolicyDetails_ClaimAmount>
    <PropPreviousPolicyDetails_NoOfClaims>0</PropPreviousPolicyDetails_NoOfClaims>
    <PropRisks_Zone_Mandatary>Zone-___dbmaster_insurer_rto_zone_code___</PropRisks_Zone_Mandatary>
    <PropRisks_VehiclePurchaseAs></PropRisks_VehiclePurchaseAs>
    <PropDistributionChannel_BusineeChanneltype></PropDistributionChannel_BusineeChanneltype>
    <PropRisks_HomeAway>false</PropRisks_HomeAway>
    <PropRisks_LegalLiabilityToEmployees>false</PropRisks_LegalLiabilityToEmployees>
    <PropRisks_PersnalExtndedProtctionPolPEPP>true</PropRisks_PersnalExtndedProtctionPolPEPP>
    <PropRisks_PersonalTripEffects>false</PropRisks_PersonalTripEffects>
    <PropRisks_NCBProtectionCover>___addon_ncb_protection_cover___</PropRisks_NCBProtectionCover>
    <PropRisks_NoOfPersonWiderLegalLiability>1</PropRisks_NoOfPersonWiderLegalLiability>
    <PropRisks_NoOfPersonsPaidDriver>___pa_paid_driver_si_3___</PropRisks_NoOfPersonsPaidDriver>
    <PropRisks_NoOfClaimsDepreciation>___addon_zero_dep_cover_2___</PropRisks_NoOfClaimsDepreciation>
    <PropRisks_PolicyNumber></PropRisks_PolicyNumber>
    <PropRisks_RegistrationAddressSameComm>true</PropRisks_RegistrationAddressSameComm>
    <PropDistributionChannel_BusinessSource_Mandatary>INTERMEDIARY</PropDistributionChannel_BusinessSource_Mandatary>
    <PropRisks_PreSourceApproval>false</PropRisks_PreSourceApproval>
    <PropGeneralProposalInformation_IsNCBApplicable>true</PropGeneralProposalInformation_IsNCBApplicable>
    <PropGeneralProposalInformation_MethodOfCalculation>GCWINPR05</PropGeneralProposalInformation_MethodOfCalculation>
    <PropRisks_WiderLegalLiabilityToPaid>___is_llpd___</PropRisks_WiderLegalLiabilityToPaid><!-- false -->   
	<PropRisks_YearLicensed>2016</PropRisks_YearLicensed>
    <PropGeneralProposalInformation_QuoteNumber></PropGeneralProposalInformation_QuoteNumber>
    <PropRisks_OtherInformation1T>___dbmaster_insurer_rto_city_code___</PropRisks_OtherInformation1T>
    <PropPreviousPolicyDetails_PolicyNo>ILG/10161408</PropPreviousPolicyDetails_PolicyNo><!---->
    <PropPreviousPolicyDetails_PreviousPolicyType>PackageComprehensive</PropPreviousPolicyDetails_PreviousPolicyType><!---->
    <PropRisks_AgeCoverageDetails>20</PropRisks_AgeCoverageDetails>
    <PropPreviousPolicyDetails_CorporateCustomerId_Mandatary>ICICI</PropPreviousPolicyDetails_CorporateCustomerId_Mandatary>
    <OtherDetailsGrid>
        <!--Non_ElectricalAccessiories_Start-->       
        <NonElectricalAccessiories Name='NonElectricalAccessiories' Value='GRP288'>
            <NonElectricalAccessiories Type='GroupData'>
                <Make Name='Make' Value='N/A' Type='String'/>
                <Model Name='Model' Value='N/A' Type='String'/>
                <Year Name='Year' Value='2017' Type='String'/>
                <IDV Name='IDV' Value='___non_electrical_accessory___' Type='Double'/>
                <TypeofAccessories Name='TypeofAccessories' Value='Other' Type='String'/>
                <Description Name='Description' Value='N/A' Type='String'/>
                <SerialNo Name='SerialNo' Value='' Type='String'/>
                <Remarks Name='SerialNo' Value='' Type='String'/>
            </NonElectricalAccessiories>
        </NonElectricalAccessiories>
        <!--Non_ElectricalAccessiories_End-->  
        <!--ElectricalAccessiories_Start-->  
        <ElectricalAccessiories Name='ElectricalAccessiories' Value='GRP289'>
            <ElectricalAccessiories Type='GroupData'>
                <Make Name='Make' Value='N/A' Type='String'/>
                <Model Name='Model' Value='N/A' Type='String'/>
                <Year Name='Year' Value='2017' Type='String'/>
                <IDV Name='IDV' Value='___electrical_accessory___' Type='Double'/>
                <TypeofAccessories Name='TypeofAccessories' Value='Other' Type='String'/>
                <Description Name='Description' Value='N/A' Type='String'/>
                <SerialNo Name='SerialNo' Value='' Type='String'/>
                <Remarks Name='SerialNo' Value='' Type='String'/>
            </ElectricalAccessiories>
        </ElectricalAccessiories>
        <!--ElectricalAccessiories_End-->  
        <OwnerDriverNomineeDetails Name='OwnerDriverNomineeDetails' Value='GRP292'>
            <OwnerDriverNomineeDetails Type='GroupData'>
                <Nominee Name='Nominee' Value='ABCD' Type='String'/>
                <Age Name='Age' Value='20' Type='Double'/>
                <Relationship Name='Relationship' Value='As attached' Type='String'/>
                <Nameofappointee Name='Nameofappointee' Value='' Type='String'/>
                <Relationshiptonominee Name='Relationshiptonominee' Value='' Type='String'/>
            </OwnerDriverNomineeDetails>
        </OwnerDriverNomineeDetails>
    </OtherDetailsGrid>
</PrivateCarInsurancePolicy>]]></InputXML>
            <IsBankDataRequired>false</IsBankDataRequired>
            <IsCutomerAddressRequired>false</IsCutomerAddressRequired>
            <IsFinanciarDataRequired>false</IsFinanciarDataRequired>
            <IsManufacturerMappingRequired>false</IsManufacturerMappingRequired>
            <IsRTOMappingRequired>false</IsRTOMappingRequired>
            <ModeOfOperation>NEWPOLICY</ModeOfOperation>
            <UserId>___insurer_integration_location_code___</UserId>
            <UserRole>BROKER CORPORATE</UserRole><!--ADMIN-->
        </ns2:createQuoteRequest>
    </soap:Body>
</soap:Envelope>